/** 基本課題2.3 動作確認クラス雛型 */
public class Task23 {
	public static void main(String[] args) {
		/* 1. キーボードで入力した氏名と電話番号を用いてスマートカードを作成 */
		System.out.println("スマートカードを作成します．");
		

		
		// スマートカードを作成
		
		// スマートカードに氏名，電話番号，初期残高を設定
		

		
		System.out.println("スマートカードを作成しました．初期残高はXXXX円です．");
		
		/* 2. 2000円を支払おうとするが残高不足のため，チャージして支払う */
		while (true) {
			// もし2000円を支払えたらループを脱出
			
			// 支払えない場合はチャージする（チャージ金額はキーボードで入力）

		}
		
		/* 3. カード残高を表示する */
		System.out.println("スマートカードの情報を表示します．");
		
	}

}
